Repository: ajoscram/Locker
Catalog: LockerApplication/Resources/Strings.*.resx
Languages: es

# COMMAND_LINE_ERROR_EXPECTED_ARGUMENT
source: Expected sub-argument.
es: Se esperaba un sub-argumento.

# COMMAND_LINE_ERROR_EXPECTED_ENCRYPTER
source: Expected an encrypter name after the password for the -decrypt argument.
es: Se esperaba un nombre de encriptador después de la contraseña para el argumento -decrypt.

# COMMAND_LINE_ERROR_EXPECTED_FIELD
source: Expected a field key after the -field argument.
es: Se esperaba una llave de campo después del argumento -field.

# COMMAND_LINE_ERROR_EXPECTED_FILEPATH
source: Expected a filepath after the -file arguement.
es: Se esperaba una ruta a un archivo después del argumento -file.

# COMMAND_LINE_ERROR_EXPECTED_FLAG
source: Expected an argument.
es: Se experaba un argumento.

# COMMAND_LINE_ERROR_EXPECTED_PASSWORD
source: Expected a password after the -decrypt argument.
es: Se experaba una contraseña después del argumento -decrypt.

# COMMAND_LINE_ERROR_MESSAGE
source: The following errors occurred while parsing the command line:
es: Los siguientes errores ocurrieron mientras se analizaba la línea de comandos:

# ENCRYPTER_ERROR_EMPTY_MESSAGE
source: The encrypter received an empty message.
es: El encriptador recibió un mensaje vacío.

# ENCRYPTER_ERROR_EMPTY_PASSWORD
source: The encrypter received an empty password.
es: El encriptador recibió una contraseña vacía.

# FILE_ERROR_CHECKS_DID_NOT_MATCH
source: File checking failed. Did you input the correct password?
es: Falló el checkeo de archivo. ¿Está seguro que tiene seleccionado el encriptador y contraseña correctos?

# FILE_ERROR_DIRECTORY_NOT_FOUND
source: The directory specified was not found.
es: El directorio expecificado no fue encontrado.

# FILE_ERROR_EMPTY_KEY
source: A key must be provided.
es: Debe introducir una llave.

# FILE_ERROR_EMPTY_VALUE
source: A value must be provided.
es: Debe introducir un valor.

# FILE_ERROR_FILE_NOT_FOUND
source: The file specified was not found. Check if the file was moved/deleted and try again.
es: El archivo especificado no fue encontrado. Revise si el archivo fue movido o borrado e intente de nuevo.

# FILE_ERROR_IO_ERROR
source: There was an I/O error. This is usually caused by hardware related problems.
es: Hubo un error de Entrada/Salida. Esto es usualmente causado por problemas de hardware.

# FILE_ERROR_KEY_CONTAINS_FIELD_SEPARATOR
source: Key contains the field separator character (NEWLINE).
es: La llave contiene el caracter separador de campos (SALTO DE LÍNEA).

# FILE_ERROR_KEY_CONTAINS_PROPERTY_SEPARATOR
source: Key contains the property separator character (TAB).
es: La llave contiene el caracter separador de propiedades (TAB).

# FILE_ERROR_MISSING_KEY
source: There is no field whose key matches the query.
es: No existe ningún campo con la llave indicada.

# FILE_ERROR_NON_VALID_PATH
source: The file path entered is not valid.
es: La ruta al archivo indicada no es válida.

# FILE_ERROR_PATH_TOO_LONG
source: The file path entered is too long for Windows to handle. Move it elsewhere and try again.
es: La ruta al archivo indicada es demasiado larga para Windows. Mueva el archivo e intente de nuevo.

# FILE_ERROR_UNAUTHORIZED_ACCESS
source: You don't have the required permission to read or write on this directory.
es: Usted no cuenta con el permiso para leer o escribir en este directorio.

# FILE_ERROR_VALUE_CONTAINS_FIELD_SEPARATOR
source: Value contains the field separator character (NEWLINE).
es: El valor contiene el caracter separador de campos (SALTO DE LÍNEA).

# UI_AboutForm
source: About Locker
es: Acerca de Locker

# UI_AboutForm_closeButton
source: Close
es: Cerrar

# UI_AboutForm_developedByLabel
source: Developed by:
es: Desarrollado por:

# UI_AboutForm_thanksLabel
source: Thanks for using locker!
es: Gracias por usar Locker!

# UI_AboutForm_versionLabel
source: Version:
es: Versión:

# UI_FieldForm
source: New Field
es: Nuevo Campo

# UI_FieldForm_addButton
source: Add
es: Agregar

# UI_FieldForm_keyLabel
source: Key:
es: Llave:

# UI_FieldForm_valueLabel
source: Value:
es: Valor:

# UI_FileForm_aboutMenuItem
source: About
es: Acerca de

# UI_FileForm_addMenuItem
source: Add
es: Agregar

# UI_FileForm_addNewFieldMenuItem
source: Add New Field
es: Agregar un Nuevo Campo

# UI_FileForm_changeSettingsMenuItem
source: Change Settings
es: Cambiar Preferencias

# UI_FileForm_closeMenuItem
source: Close
es: Cerrar

# UI_FileForm_copySelectedToClipboardMenuItem
source: Copy Selected to Clipboard
es: Copiar Seleccionado al Portapapeles

# UI_FileForm_copyToClipboardMenuItem
source: Copy to Clipboard
es: Copiar al Portapapeles

# UI_FileForm_deleteMenuItem
source: Delete
es: Borrar

# UI_FileForm_deleteSelectedMenuItem
source: Delete Selected
es: Borrar Seleccionado

# UI_FileForm_DELETE_FIELD
source: Are you sure you wish to delete the field? This cannot be undone.
es: ¿Está seguro que desea eliminar el campo? Esto no se puede deshacer.

# UI_FileForm_editMenuItem
source: Edit
es: Editar

# UI_FileForm_exitMenuItem
source: Exit
es: Salir

# UI_FileForm_fileMenuItem
source: File
es: Archivo

# UI_FileForm_FILE_SAVED
source: File saved!
es: Archivo guardado!

# UI_FileForm_helpMenuItem
source: Help
es: Ayuda

# UI_FileForm_newMenuItem
source: New
es: Nuevo

# UI_FileForm_NEW_FILE
source: New File
es: Nuevo Archivo

# UI_FileForm_noFileLabel
source: Press Ctrl+O to open a file. Press Ctrl+N to create a new file.
es: Presione Ctrl+O para abrir un archivo. Presione Ctrl+N para crear un archivo.

# UI_FileForm_NO_FIELD_SELECTED
source: No field selected.
es: Ningún campo seleccionado.

# UI_FileForm_NO_FILE_OPENED
source: No file opened.
es: Ningún archivo abierto.

# UI_FileForm_openMenuItem
source: Open
es: Abrir

# UI_FileForm_OVERWRITE_KEY
source: The field key already exists in this file. Overwrite?
es: La llave del campo ya existe en el archivo. Desea sobreescribirla?

# UI_FileForm_saveMenuItem
source: Save As
es: Guardar Como

# UI_FileForm_settingsMenuItem
source: Settings
es: Preferencias

# UI_FileForm_sortAlphabeticallyMenuItem
source: Sort Alphabetically
es: Ordenar Alfabéticamente

# UI_FileForm_UNSAVED_CHANGES
source: You have unsaved changes. Do you wish to save before closing this file?
es: Usted tiene cambios sin guardar. Desea guardar antes de cerrar el archivo?

# UI_FileForm_viewHelpMenuItem
source: View Help
es: Ver Ayuda en Línea

# UI_OpenForm
source: Open File
es: Abrir Archivo

# UI_OpenForm_openButton
source: Open
es: Abrir

# UI_OpenForm_passwordLabel
source: Password:
es: Contraseña:

# UI_SaveForm
source: Save File
es: Guardar Archivo

# UI_SaveForm_passwordLabel
source: Password:
es: Contraseña:

# UI_SaveForm_saveButton
source: Save
es: Guardar

# UI_SettingsForm
source: Settings
es: Preferencias

# UI_SettingsForm_clipboardLabel
source: Clipboard Timeout:
es: Tiempo para copias:

# UI_SettingsForm_languageLabel
source: Language:
es: Lenguaje:

# UI_SettingsForm_saveButton
source: Save Changes
es: Guardar Cambios

# UI_SettingsForm_SETTINGS_SAVED
source: Settings Saved!
es: Preferencias guardadas!

# UI_SettingsForm_TIME_EQUALS_ZERO
source: You must input at least a second of time for the clipboard timeout.
es: Debe poner por lo menos un segundo de tiempo para las copias en el portapapeles.

# UI_AboutForm_iconLinkLabel
source: Icon by Chanut from Flaticon.com
es: Ícono por Chanut de Flaticon.com
